"""Удивительно, но существует только три числа, которые могут быть записаны в виде суммы четвертых степеней их цифр:

1634 = 14 + 64 + 34 + 44
8208 = 84 + 24 + 04 + 84
9474 = 94 + 44 + 74 + 44
1 = 14 не считается, так как это - не сумма.

Сумма этих чисел равна 1634 + 8208 + 9474 = 19316.

Найдите сумму всех чисел, которые могут быть записаны в виде суммы пятых степеней их цифр."""
'''Дані числа, очевидно, менше мільйона, поскільки приріст від додаткового числа не можеже перевищувати 9**5, тоді розв'язки
слід шукати серед чисел 10**2<a<10**6'''
sum = 0
for i1 in range(1,10):
    for i2 in range(1, 10):
        for i3 in range(1, 10):
            for i4 in range(1, 10):
                for i5 in range(1, 10):
                    for i5 in range(1,10):
                        for i6 in range(1,10):
                                s = 10**4*i1 + 10**3*i2 + 10**2*i3 + 10**1*i4 + i4 + 10**5*i6
                                if i1**5 + i2**5 + i3**5 + i4**5 + i5**5 + i6**5 == s:
                                    sum+=s

for i2 in range(1, 10):
    for i3 in range(1, 10):
        for i4 in range(1, 10):
            for i5 in range(1, 10):
                for i5 in range(1,10):
                    for i6 in range(1,10):
                        s = 10**4*i2 + 10**3*i3 + 10**2*i4 + 10**1*i5 + i6
                        if i2**5 + i3**5 + i4**5 + i5**5 + i6**5 == s:
                            sum += s

for i3 in range(1, 10):
    for i4 in range(1, 10):
        for i5 in range(1, 10):
            for i5 in range(1,10):
                for i6 in range(1,10):
                    s =  10**3*i3 + 10**2*i4 + 10**1*i5 + i6
                    if i3**5 + i4**5 + i5**5 + i6**5 == s:
                        sum += s

for i4 in range(1, 10):
    for i5 in range(1, 10):
        for i5 in range(1,10):
            for i6 in range(1,10):
                s =  10**2*i4 + 10**1*i5 + i6
                if i4**5 + i5**5 + i6**5 == s:
                    sum += s

print(sum)